{
  "resume_name": "Austin Ronald Scott",
  "slogan": "ars (noun, latin): 1. art, skill 2. craft, power",
  "contact_info": [
    "Venice, CA",
    "310.801.2667",
    "ars@austinrscott.com",
    "https://github.com/xeirxes"
  ],
  "sections": [
    {
      "name": "Full Stack Engineer",
      "skills": [
        "C++/C#",
        "Flask",
        "Git",
        "HTML",
        "JavaScript/jQuery",
        "Python",
        "React",
        "Sass/CSS",
        "Scrapy",
        "Selenium",
        "SQLite/Postgres",
        "Tk"
      ],
      "projects": [
        {
          "name": "This React Resume",
          "date": "October 22-24th, 2018",
          "location": "Venice, CA",
          "desc": "Because I didn't have any proof of my ability to use this framework, and because I frequently see it as a desired skill, I decided to engage with it on a small project and attempt to build something. I hadn't completed anything using React before I did this project. It took me 5-6 hours of research and tutorials, 3 hours to design the graphics, and about another 6 hours of coding to get the page done. I used Adobe Illustrator for the layout and PyCharm as my IDE."
        },
        {
          "name": "Crazy Avey Land WooCommerce Automations",
          "url": "https://crazyavey.com/",
          "date": "September 2018",
          "location": "Venice, CA",
          "desc": "I built a set of Python scripts that accesses a small eCommerce store, pulls order data from the REST API, performs some business logic upon the orders and turns them into .CSV files, ready for input into the label merge software (Adobe InDesign). After the shipping has been done, the shipping receipt is scraped to provide the script with tracking numbers matched to their corresponding ZIP codes. Lastly, the program uses these ZIP codes to match the tracking number with the order, mark the order as 'Completed' using the REST API, and then sends the customer a note with their tracking information."
        },
        {
          "name": "Universal Motorsports Vendor Tracking Scraper",
          "url": "http://shopuniversalpowersports.com/",
          "date": "February 2018",
          "location": "Eugene, OR",
          "desc": "A small business drop-ships motorcycle parts from several vendors whose sites date back to the early 2000's. As such, their vendors have no APIs in place or anything to automate the data access. Universal Motorsports has been established for several years and they have a big volume of sales. I used Python to create a dashboard with Tk. I studied the vendor websites and created a modular design, whereby I'd be able to write detailed implementations for each vendor's Selenium scraping process and produce the data in a uniform fashion. After the program goes and finds tracking numbers, it outputs a .CSV file which is ready to be imported into ShipStation and notifies the client."
        }
      ]
    },
    {
      "name": "Technical Producer",
      "skills": [
        "3D Design",
        "Audio Engineering",
        "Cinematography",
        "Film Scoring",
        "Graphic Design",
        "Photography",
        "Sound Effects",
        "VFX",
        "Video Editing"
      ],
      "projects": [
        {
          "name": "Crazy Avey Land",
          "url": "https://youtube.com/c/CrazyAveyLand",
          "date": "March 2018 - Present",
          "location": "Venice, CA",
          "desc": "Crazy Avey Land is a YouTube variety show that began in March 2018. Anne Marie Avey is the director, producer, writer and actress, and I came alongside her to support with any and all technical production. Anne Marie comes up with ideas, and I figure out how to get them done."
        },
        {
          "name": "Obsess/Release",
          "url": "https://open.spotify.com/album/2fLGtongrHboV3fcWnaak9",
          "date": "October 2017 - February 2018",
          "location": "Carson City, NV",
          "desc": "I hadn't finished any body of work as a musician and it was pulling at my heart-strings. So in 2017 I made plans to go on a hiatus, establish a temporary studio in my home state, and get my first piece of major work done. I was in control of the work throughout the entire process of writing, recording, mixing and mastering, and I didn't outsource any of it. I am proud of the audio quality, but I look forward to making more albums with more focused energy — this one takes a lot of detours and is rather scattered."
        }
      ]
    },
    {
      "name": "Polymath",
      "skills": [
        "3D Printing",
        "Acting",
        "Consulting",
        "Interior Architecture",
        "Musician/Singer-Songwriter",
        "Office Management",
        "Sales/Marketing",
        "Training/Tutoring",
        "Writing"
      ],
      "projects": [
        {
          "name": "BEAM Healing Relocation Consulting",
          "date": "June 2018 - November 2018",
          "location": "Santa Monica, CA",
          "desc": "BEAM Healing is a small holistic healthcare clinic that is in the process of a major downsize and relocation. As the clinic approaches its move date, I've been working closely with the owner to plan out their new space and to calculate projected storage costs. Much of my work has involved drawing detailed to-scale images of the potential future locations, and creating an inventory list of all furniture with its sizing. I created a physical model of the office to aid in the planning and design."
        },
        {
          "name": "Crazy Avey Land WP + WooCommerce Merch Store",
          "url": "https://crazyavey.com/",
          "date": "May 2018 - Current",
          "location": "Venice, CA",
          "desc": "I was brought in to help with supply chain research, graphic design, and website deployment. I am also training the team and establishing protocols for processing orders and shipping."
        }
      ]
    }
  ]
}